Meshes & Solutions/blockgen-32/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       6840;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       6940;
    }
    polygon
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          320;
        startFace       7040;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          3600;
        startFace       7360;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          3600;
        startFace       10960;
    }
    outside
    {
        type            patch;
        nFaces          200;
        startFace       14560;
    }
)

// ************************************************************************* //
