Meshes & Solutions/blockgen-32/system/blockMeshDict
// File generated on 04-28-2024

// # Sides: 32
// Diameter: 1
// Foreground: 4
// Wake: 10
// Width: 4
// Height: 0.1
// Resolution: 10

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
                   
convertToMeters 1;

vertices
(
		 ( 18                  2.097545161008064   0.05  ) // 0  
		 ( 6.490392640201615   2.097545161008064   0.05  ) // 1  
		 ( 6.5                 2.0                 0.05  ) // 2  
		 ( 18                  2.0                 0.05  ) // 3  
		 ( 18                  2.191341716182545   0.05  ) // 4  
		 ( 6.461939766255643   2.191341716182545   0.05  ) // 5  
		 ( 18                  2.277785116509801   0.05  ) // 6  
		 ( 6.4157348061512725  2.277785116509801   0.05  ) // 7  
		 ( 18                  2.353553390593274   0.05  ) // 8  
		 ( 6.353553390593274   2.353553390593274   0.05  ) // 9  
		 ( 6.2777851165098015  4                   0.05  ) // 10 
		 ( 6.2777851165098015  2.4157348061512725  0.05  ) // 11 
		 ( 6.353553390593274   4                   0.05  ) // 12 
		 ( 6.191341716182545   4                   0.05  ) // 13 
		 ( 6.191341716182545   2.4619397662556435  0.05  ) // 14 
		 ( 6.097545161008064   4                   0.05  ) // 15 
		 ( 6.097545161008064   2.490392640201615   0.05  ) // 16 
		 ( 6.0                 4                   0.05  ) // 17 
		 ( 6.0                 2.5                 0.05  ) // 18 
		 ( 5.902454838991936   4                   0.05  ) // 19 
		 ( 5.902454838991936   2.490392640201615   0.05  ) // 20 
		 ( 5.808658283817455   4                   0.05  ) // 21 
		 ( 5.808658283817455   2.4619397662556435  0.05  ) // 22 
		 ( 5.722214883490199   4                   0.05  ) // 23 
		 ( 5.722214883490199   2.4157348061512725  0.05  ) // 24 
		 ( 5.646446609406726   4                   0.05  ) // 25 
		 ( 5.646446609406726   2.353553390593274   0.05  ) // 26 
		 ( 0                   2.277785116509801   0.05  ) // 27 
		 ( 5.5842651938487275  2.277785116509801   0.05  ) // 28 
		 ( 0                   2.353553390593274   0.05  ) // 29 
		 ( 0                   2.191341716182545   0.05  ) // 30 
		 ( 5.538060233744357   2.191341716182545   0.05  ) // 31 
		 ( 0                   2.0975451610080644  0.05  ) // 32 
		 ( 5.509607359798385   2.0975451610080644  0.05  ) // 33 
		 ( 0                   2.0                 0.05  ) // 34 
		 ( 5.5                 2.0                 0.05  ) // 35 
		 ( 0                   1.9024548389919358  0.05  ) // 36 
		 ( 5.509607359798385   1.9024548389919358  0.05  ) // 37 
		 ( 0                   1.8086582838174552  0.05  ) // 38 
		 ( 5.538060233744357   1.8086582838174552  0.05  ) // 39 
		 ( 0                   1.722214883490199   0.05  ) // 40 
		 ( 5.5842651938487275  1.722214883490199   0.05  ) // 41 
		 ( 0                   1.6464466094067263  0.05  ) // 42 
		 ( 5.646446609406726   1.6464466094067263  0.05  ) // 43 
		 ( 5.722214883490199   0                   0.05  ) // 44 
		 ( 5.722214883490199   1.5842651938487273  0.05  ) // 45 
		 ( 5.646446609406726   0                   0.05  ) // 46 
		 ( 5.808658283817455   0                   0.05  ) // 47 
		 ( 5.808658283817455   1.5380602337443567  0.05  ) // 48 
		 ( 5.902454838991936   0                   0.05  ) // 49 
		 ( 5.902454838991936   1.5096073597983848  0.05  ) // 50 
		 ( 6.0                 0                   0.05  ) // 51 
		 ( 6.0                 1.5                 0.05  ) // 52 
		 ( 6.097545161008064   0                   0.05  ) // 53 
		 ( 6.097545161008064   1.5096073597983848  0.05  ) // 54 
		 ( 6.191341716182545   0                   0.05  ) // 55 
		 ( 6.191341716182545   1.5380602337443567  0.05  ) // 56 
		 ( 6.277785116509801   0                   0.05  ) // 57 
		 ( 6.277785116509801   1.5842651938487273  0.05  ) // 58 
		 ( 6.353553390593274   0                   0.05  ) // 59 
		 ( 6.353553390593274   1.646446609406726   0.05  ) // 60 
		 ( 18                  1.722214883490199   0.05  ) // 61 
		 ( 6.4157348061512725  1.722214883490199   0.05  ) // 62 
		 ( 18                  1.646446609406726   0.05  ) // 63 
		 ( 18                  1.8086582838174547  0.05  ) // 64 
		 ( 6.461939766255643   1.8086582838174547  0.05  ) // 65 
		 ( 18                  1.9024548389919356  0.05  ) // 66 
		 ( 6.490392640201615   1.9024548389919356  0.05  ) // 67 
		 ( 0                   0                   0.05  ) // 68 
		 ( 0                   4                   0.05  ) // 69 
		 ( 18                  0                   0.05  ) // 70 
		 ( 18                  4                   0.05  ) // 71 
		 ( 18                  2.097545161008064   -0.05 ) // 72 
		 ( 6.490392640201615   2.097545161008064   -0.05 ) // 73 
		 ( 6.5                 2.0                 -0.05 ) // 74 
		 ( 18                  2.0                 -0.05 ) // 75 
		 ( 18                  2.191341716182545   -0.05 ) // 76 
		 ( 6.461939766255643   2.191341716182545   -0.05 ) // 77 
		 ( 18                  2.277785116509801   -0.05 ) // 78 
		 ( 6.4157348061512725  2.277785116509801   -0.05 ) // 79 
		 ( 18                  2.353553390593274   -0.05 ) // 80 
		 ( 6.353553390593274   2.353553390593274   -0.05 ) // 81 
		 ( 6.2777851165098015  4                   -0.05 ) // 82 
		 ( 6.2777851165098015  2.4157348061512725  -0.05 ) // 83 
		 ( 6.353553390593274   4                   -0.05 ) // 84 
		 ( 6.191341716182545   4                   -0.05 ) // 85 
		 ( 6.191341716182545   2.4619397662556435  -0.05 ) // 86 
		 ( 6.097545161008064   4                   -0.05 ) // 87 
		 ( 6.097545161008064   2.490392640201615   -0.05 ) // 88 
		 ( 6.0                 4                   -0.05 ) // 89 
		 ( 6.0                 2.5                 -0.05 ) // 90 
		 ( 5.902454838991936   4                   -0.05 ) // 91 
		 ( 5.902454838991936   2.490392640201615   -0.05 ) // 92 
		 ( 5.808658283817455   4                   -0.05 ) // 93 
		 ( 5.808658283817455   2.4619397662556435  -0.05 ) // 94 
		 ( 5.722214883490199   4                   -0.05 ) // 95 
		 ( 5.722214883490199   2.4157348061512725  -0.05 ) // 96 
		 ( 5.646446609406726   4                   -0.05 ) // 97 
		 ( 5.646446609406726   2.353553390593274   -0.05 ) // 98 
		 ( 0                   2.277785116509801   -0.05 ) // 99 
		 ( 5.5842651938487275  2.277785116509801   -0.05 ) // 100
		 ( 0                   2.353553390593274   -0.05 ) // 101
		 ( 0                   2.191341716182545   -0.05 ) // 102
		 ( 5.538060233744357   2.191341716182545   -0.05 ) // 103
		 ( 0                   2.0975451610080644  -0.05 ) // 104
		 ( 5.509607359798385   2.0975451610080644  -0.05 ) // 105
		 ( 0                   2.0                 -0.05 ) // 106
		 ( 5.5                 2.0                 -0.05 ) // 107
		 ( 0                   1.9024548389919358  -0.05 ) // 108
		 ( 5.509607359798385   1.9024548389919358  -0.05 ) // 109
		 ( 0                   1.8086582838174552  -0.05 ) // 110
		 ( 5.538060233744357   1.8086582838174552  -0.05 ) // 111
		 ( 0                   1.722214883490199   -0.05 ) // 112
		 ( 5.5842651938487275  1.722214883490199   -0.05 ) // 113
		 ( 0                   1.6464466094067263  -0.05 ) // 114
		 ( 5.646446609406726   1.6464466094067263  -0.05 ) // 115
		 ( 5.722214883490199   0                   -0.05 ) // 116
		 ( 5.722214883490199   1.5842651938487273  -0.05 ) // 117
		 ( 5.646446609406726   0                   -0.05 ) // 118
		 ( 5.808658283817455   0                   -0.05 ) // 119
		 ( 5.808658283817455   1.5380602337443567  -0.05 ) // 120
		 ( 5.902454838991936   0                   -0.05 ) // 121
		 ( 5.902454838991936   1.5096073597983848  -0.05 ) // 122
		 ( 6.0                 0                   -0.05 ) // 123
		 ( 6.0                 1.5                 -0.05 ) // 124
		 ( 6.097545161008064   0                   -0.05 ) // 125
		 ( 6.097545161008064   1.5096073597983848  -0.05 ) // 126
		 ( 6.191341716182545   0                   -0.05 ) // 127
		 ( 6.191341716182545   1.5380602337443567  -0.05 ) // 128
		 ( 6.277785116509801   0                   -0.05 ) // 129
		 ( 6.277785116509801   1.5842651938487273  -0.05 ) // 130
		 ( 6.353553390593274   0                   -0.05 ) // 131
		 ( 6.353553390593274   1.646446609406726   -0.05 ) // 132
		 ( 18                  1.722214883490199   -0.05 ) // 133
		 ( 6.4157348061512725  1.722214883490199   -0.05 ) // 134
		 ( 18                  1.646446609406726   -0.05 ) // 135
		 ( 18                  1.8086582838174547  -0.05 ) // 136
		 ( 6.461939766255643   1.8086582838174547  -0.05 ) // 137
		 ( 18                  1.9024548389919356  -0.05 ) // 138
		 ( 6.490392640201615   1.9024548389919356  -0.05 ) // 139
		 ( 0                   0                   -0.05 ) // 140
		 ( 0                   4                   -0.05 ) // 141
		 ( 18                  0                   -0.05 ) // 142
		 ( 18                  4                   -0.05 ) // 143
);

blocks
(
		hex (72  73  74  75  0   1   2   3  ) (10 10 1) simpleGrading (1 1 1) // 0
		hex (76  77  73  72  4   5   1   0  ) (10 10 1) simpleGrading (1 1 1) // 1
		hex (78  79  77  76  6   7   5   4  ) (10 10 1) simpleGrading (1 1 1) // 2
		hex (80  81  79  78  8   9   7   6  ) (10 10 1) simpleGrading (1 1 1) // 3
		hex (82  83  81  84  10  11  9   12 ) (10 10 1) simpleGrading (1 1 1) // 4
		hex (85  86  83  82  13  14  11  10 ) (10 10 1) simpleGrading (1 1 1) // 5
		hex (87  88  86  85  15  16  14  13 ) (10 10 1) simpleGrading (1 1 1) // 6
		hex (89  90  88  87  17  18  16  15 ) (10 10 1) simpleGrading (1 1 1) // 7
		hex (91  92  90  89  19  20  18  17 ) (10 10 1) simpleGrading (1 1 1) // 8
		hex (93  94  92  91  21  22  20  19 ) (10 10 1) simpleGrading (1 1 1) // 9
		hex (95  96  94  93  23  24  22  21 ) (10 10 1) simpleGrading (1 1 1) // 10
		hex (97  98  96  95  25  26  24  23 ) (10 10 1) simpleGrading (1 1 1) // 11
		hex (99  100 98  101 27  28  26  29 ) (10 10 1) simpleGrading (1 1 1) // 12
		hex (102 103 100 99  30  31  28  27 ) (10 10 1) simpleGrading (1 1 1) // 13
		hex (104 105 103 102 32  33  31  30 ) (10 10 1) simpleGrading (1 1 1) // 14
		hex (106 107 105 104 34  35  33  32 ) (10 10 1) simpleGrading (1 1 1) // 15
		hex (108 109 107 106 36  37  35  34 ) (10 10 1) simpleGrading (1 1 1) // 16
		hex (110 111 109 108 38  39  37  36 ) (10 10 1) simpleGrading (1 1 1) // 17
		hex (112 113 111 110 40  41  39  38 ) (10 10 1) simpleGrading (1 1 1) // 18
		hex (114 115 113 112 42  43  41  40 ) (10 10 1) simpleGrading (1 1 1) // 19
		hex (116 117 115 118 44  45  43  46 ) (10 10 1) simpleGrading (1 1 1) // 20
		hex (119 120 117 116 47  48  45  44 ) (10 10 1) simpleGrading (1 1 1) // 21
		hex (121 122 120 119 49  50  48  47 ) (10 10 1) simpleGrading (1 1 1) // 22
		hex (123 124 122 121 51  52  50  49 ) (10 10 1) simpleGrading (1 1 1) // 23
		hex (125 126 124 123 53  54  52  51 ) (10 10 1) simpleGrading (1 1 1) // 24
		hex (127 128 126 125 55  56  54  53 ) (10 10 1) simpleGrading (1 1 1) // 25
		hex (129 130 128 127 57  58  56  55 ) (10 10 1) simpleGrading (1 1 1) // 26
		hex (131 132 130 129 59  60  58  57 ) (10 10 1) simpleGrading (1 1 1) // 27
		hex (133 134 132 135 61  62  60  63 ) (10 10 1) simpleGrading (1 1 1) // 28
		hex (136 137 134 133 64  65  62  61 ) (10 10 1) simpleGrading (1 1 1) // 29
		hex (138 139 137 136 66  67  65  64 ) (10 10 1) simpleGrading (1 1 1) // 30
		hex (75  74  139 138 3   2   67  66 ) (10 10 1) simpleGrading (1 1 1) // 31
		hex (140 118 115 114 68  46  43  42 ) (10 10 1) simpleGrading (1 1 1) // 32
		hex (101 98  97  141 29  26  25  69 ) (10 10 1) simpleGrading (1 1 1) // 33
		hex (135 132 131 142 63  60  59  70 ) (10 10 1) simpleGrading (1 1 1) // 34
		hex (143 84  81  80  71  12  9   8  ) (10 10 1) simpleGrading (1 1 1) // 35
);

edges
(
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(101 29  27  99 )
			(99  27  30  102)
			(102 30  32  104)
			(104 32  34  106)
			(106 34  36  108)
			(108 36  38  110)
			(110 38  40  112)
			(112 40  42  114)
			(140 68  42  114)
			(101 29  69  141)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			(75  3   0   72 )
			(72  0   4   76 )
			(76  4   6   78 )
			(78  6   8   80 )
			(135 63  61  133)
			(133 61  64  136)
			(136 64  66  138)
			(138 66  3   75 )
			(135 63  70  142)
			(143 71  8   80 )
		);
	}

	polygon
	{
		type wall;
		faces
		(
			(74  2   1   73 )
			(77  5   1   73 )
			(79  7   5   77 )
			(81  9   7   79 )
			(83  11  9   81 )
			(86  14  11  83 )
			(88  16  14  86 )
			(90  18  16  88 )
			(92  20  18  90 )
			(94  22  20  92 )
			(96  24  22  94 )
			(98  26  24  96 )
			(100 28  26  98 )
			(103 31  28  100)
			(105 33  31  103)
			(107 35  33  105)
			(109 37  35  107)
			(111 39  37  109)
			(113 41  39  111)
			(115 43  41  113)
			(117 45  43  115)
			(120 48  45  117)
			(122 50  48  120)
			(124 52  50  122)
			(126 54  52  124)
			(128 56  54  126)
			(130 58  56  128)
			(132 60  58  130)
			(134 62  60  132)
			(137 65  62  134)
			(139 67  65  137)
			(139 67  2   74 )
		);
	}

	top
	{
		type symmetryPlane;
		faces
		(
			(0   1   2   3  )
			(4   5   1   0  )
			(6   7   5   4  )
			(8   9   7   6  )
			(10  11  9   12 )
			(13  14  11  10 )
			(15  16  14  13 )
			(17  18  16  15 )
			(19  20  18  17 )
			(21  22  20  19 )
			(23  24  22  21 )
			(25  26  24  23 )
			(27  28  26  29 )
			(30  31  28  27 )
			(32  33  31  30 )
			(34  35  33  32 )
			(36  37  35  34 )
			(38  39  37  36 )
			(40  41  39  38 )
			(42  43  41  40 )
			(44  45  43  46 )
			(47  48  45  44 )
			(49  50  48  47 )
			(51  52  50  49 )
			(53  54  52  51 )
			(55  56  54  53 )
			(57  58  56  55 )
			(59  60  58  57 )
			(61  62  60  63 )
			(64  65  62  61 )
			(66  67  65  64 )
			(3   2   67  66 )
			(68  46  43  42 )
			(29  26  25  69 )
			(63  60  59  70 )
			(71  12  9   8  )
		);
	}

	bottom
	{
		type symmetryPlane;
		faces
		(
			(72  73  74  75 )
			(76  77  73  72 )
			(78  79  77  76 )
			(80  81  79  78 )
			(82  83  81  84 )
			(85  86  83  82 )
			(87  88  86  85 )
			(89  90  88  87 )
			(91  92  90  89 )
			(93  94  92  91 )
			(95  96  94  93 )
			(97  98  96  95 )
			(99  100 98  101)
			(102 103 100 99 )
			(104 105 103 102)
			(106 107 105 104)
			(108 109 107 106)
			(110 111 109 108)
			(112 113 111 110)
			(114 115 113 112)
			(116 117 115 118)
			(119 120 117 116)
			(121 122 120 119)
			(123 124 122 121)
			(125 126 124 123)
			(127 128 126 125)
			(129 130 128 127)
			(131 132 130 129)
			(133 134 132 135)
			(136 137 134 133)
			(138 139 137 136)
			(75  74  139 138)
			(140 118 115 114)
			(101 98  97  141)
			(135 132 131 142)
			(143 84  81  80 )
		);
	}

	outside
	{
		type patch;
		faces
		(
			(84  12  10  82 )
			(82  10  13  85 )
			(85  13  15  87 )
			(87  15  17  89 )
			(89  17  19  91 )
			(91  19  21  93 )
			(93  21  23  95 )
			(95  23  25  97 )
			(118 46  44  116)
			(116 44  47  119)
			(119 47  49  121)
			(121 49  51  123)
			(123 51  53  125)
			(125 53  55  127)
			(127 55  57  129)
			(129 57  59  131)
			(118 46  68  140)
			(141 69  25  97 )
			(142 70  59  131)
			(84  12  71  143)
		);
	}

);

mergePatchPairs
(
);

